app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.all_ratings
    ratings = params[:ratings]
    if ratings != nil
      if ratings.empty?
---
SELECT "movies".* FROM "movies" WHERE "movies"."ratings" IN ('G')